akinakano/RP2040_battery_control/App/Src/motion_controller.c
    // バイアス推定値を取得
    float bias[3];
    vqf_GetBiasEstimate(bias);

    float vqf_gyro[3] = {imu_gyro[0] - bias[0], -(imu_gyro[1] - bias[1]), (imu_gyro[2] - bias[2])};

    // 姿勢をクォータニオンで取得
    float quat[4];
    vqf_GetQuat6D(quat);
    
    for (int i=0; i<3; i++){
        if (imu_data.calib_end){
            imu_data.acc[i]  -= imu_data.acc_bias[i];
            imu_data.gyro[i] -= imu_data.gyro_bias[i];

            //imu_data.theta[i] += imu_data.gyro[i] / MOTION_CONTROL_FREQ;
            //imu_data.theta[i] = MC_CLIP_PI(imu_data.theta[i]);
        } else {
            //imu_data.theta[i] = 0.0f;
        }
    }

    // キャリブが終わっていたらゲイン調整(APから遅れて貰うため)
    if (imu_data.calib_end) {
        imu_data.gyro[Z_AXIS] *= imu_data.gyro_scale_gain;
    }

    imu_data.uni_acc[X_AXIS].f  = imu_data.acc[X_AXIS];
    imu_data.uni_acc[Y_AXIS].f  = imu_data.acc[Y_AXIS];
    imu_data.uni_acc[Z_AXIS].f  = imu_data.acc[Z_AXIS];
    imu_data.uni_gyro[X_AXIS].f = imu_data.gyro[X_AXIS];
    imu_data.uni_gyro[Y_AXIS].f = imu_data.gyro[Y_AXIS];
    imu_data.uni_gyro[Z_AXIS].f = imu_data.gyro[Z_AXIS];
#endif

#ifdef MC_UNCONTROLLABLE_EMMERGENCY
    static uint16_t uncontroll_count = 0;
    if( (fabsf(sv_res[SV1_FR].vel_res) > MC_OVER_MOTOR_OMEGA) && (fabsf(sv_res[SV2_FL].vel_res) > MC_OVER_MOTOR_OMEGA) ){
        uncontroll_count += 1;
    }else{
        if(uncontroll_count > 1){
            uncontroll_count -= 1;
        }
    }

    if(uncontroll_count > MC_UNCONTROLLABLE_LIMIT){
        uncontroll_count = 0;
        ApMpData[apmpBank].cmd = AP_MP_CMD_IDLE;
    }

#endif

#if (COMM_APMP_SW == COMM_APMP_ON)
    // //apから受信したデータの読み取り処理
#if 0
    static uint8_t flag = 0;
    if(ApMpData[apmpBank].cmd == AP_MP_CMD_IDLE){
        MC_state.state = MC_STATE_STOP;
        flag = 0;
    }else if(ApMpData[apmpBank].cmd == AP_MP_CMD_RUN){
        if(flag == 0){
            MC_state.state = MC_STATE_START;
        }
        flag = 1;
    }
#endif
    //指示値リミット
    BVC.vel_cmd_raw[X_AXIS] = LIM_MIN_MAX(BVC.vel_cmd_raw[X_AXIS], - BODY_VX_LIMIT, BODY_VX_LIMIT);
    BVC.vel_cmd_raw[Y_AXIS] = LIM_MIN_MAX(BVC.vel_cmd_raw[Y_AXIS], - BODY_VY_LIMIT, BODY_VY_LIMIT);
    BVC.vel_cmd_raw[Z_AXIS] = LIM_MIN_MAX(BVC.vel_cmd_raw[Z_AXIS], - BODY_WZ_LIMIT, BODY_WZ_LIMIT);

    // ************************************
    // 中心方向加速度リミット
    // ************************************
    const float a_max = 6.0f;   // 6.0 m/s
    float x_vel_ref = BVC.vel_ref[X_AXIS];
    //float z_vel_ref = BVC.vel_ref[Z_AXIS];
    float z_vel_ref = BVC.vel_cmd[Z_AXIS];

    if (fabsf(x_vel_ref * z_vel_ref) > a_max) {
        x_vel_ref = (x_vel_ref < 0.0f ? -1.0f : 1.0f) * a_max / fabsf(z_vel_ref);
        BVC.vel_ref[X_AXIS] = x_vel_ref;
        BVC.BVC_debug_flag |= FLAG_BVC_LIM_CENTORIPETAL_FORCE;
    }

#if 1
    // 加速度リミット
    //const float max_acc = 1.5f;     // m/s/s
    //const float max_acc = 6.0f;     // m/s/s
    const float max_acc = 2.5f;     // m/s/s
    BVC.vel_cmd[X_AXIS] = MC_DELTA_LIMIT(BVC.vel_cmd[X_AXIS], BVC.vel_cmd_raw[X_AXIS], max_acc / MOTION_CONTROL_FREQ);
    if(BVC.vel_cmd[X_AXIS] != BVC.vel_cmd_raw[X_AXIS]){
        BVC.BVC_debug_flag |= FLAG_BVC_LIM_ACC;
    }

    // 角加速度リミット
    //const float max_arate = 20.0f;   // rad/s/s
    //const float max_arate = 100.0f;   // rad/s/s
    const float max_arate = 15.0f;   // rad/s/s
    BVC.vel_cmd[Z_AXIS] = MC_DELTA_LIMIT(BVC.vel_cmd[Z_AXIS], BVC.vel_cmd_raw[Z_AXIS], max_arate / MOTION_CONTROL_FREQ);


#else
    BVC.vel_cmd[X_AXIS] = BVC.vel_cmd_raw[X_AXIS]; 
    BVC.vel_cmd[Z_AXIS] = BVC.vel_cmd_raw[Z_AXIS];
#endif

#elif (COMM_APMP_SW == COMM_APMP_OFF)
#endif

    // ************************************
    // 速度指示値から位置指令値(VPOS)を生成
    // ************************************
    // 自己移動量を計算する
    float delta_yaw = BVC.vel_cmd[Z_AXIS] / MOTION_CONTROL_FREQ;
    float pos_cmd_body_x = BVC.vel_cmd[X_AXIS] / MOTION_CONTROL_FREQ * cosf(BVC.pos_cmd[Z_AXIS] + delta_yaw / 2.0f);
    float pos_cmd_body_y = BVC.vel_cmd[X_AXIS] / MOTION_CONTROL_FREQ * sinf(BVC.pos_cmd[Z_AXIS] + delta_yaw / 2.0f);

    // ローカル座標系の自己位置を更新する
    BVC.pos_cmd[X_AXIS] += pos_cmd_body_x;
    BVC.pos_cmd[Y_AXIS] += pos_cmd_body_y;
    //BVC.pos_cmd[Z_AXIS] += delta_yaw;
    BVC.pos_cmd[Z_AXIS] = MC_CLIP_PI(BVC.pos_cmd[Z_AXIS] + delta_yaw);

    // ************************************
    // オドメトリの計算
    // ************************************

    // ボディーのX軸に合わせる
    ODOM_data.sv1_delta_len = (int16_t)(sv_data[SV1_FR].mr - ODOM_data.sv1_mr_prev) * (SMC_PI_F * MECP.wheel_radius_r / 32767.0f) * SV1_DIRECTION;
    ODOM_data.sv2_delta_len = (int16_t)(sv_data[SV2_FL].mr - ODOM_data.sv2_mr_prev) * (SMC_PI_F * MECP.wheel_radius_l / 32767.0f) * SV2_DIRECTION;
    ODOM_data.sv1_mr_prev = sv_data[SV1_FR].mr;
    ODOM_data.sv2_mr_prev = sv_data[SV2_FL].mr;

    // ホイールの移動量から回転角度を求める
    // V1dt=(R+d)*ωdt、V2dt=(R-d)*ωdt
    // R=V1dt/ωdt-d、R=V2dt/ωdt+d
    // ωdt=(V1dt-V2dt)/2d
#if 0
    ODOM_data.delta_theta = (ODOM_data.sv1_delta_len - ODOM_data.sv2_delta_len) / (MECP.tread);
#elif 0
    ODOM_data.delta_theta = imu_data.gyro[Z_AXIS] / MOTION_CONTROL_FREQ;
#else
    ODOM_data.delta_theta_odom = (ODOM_data.sv1_delta_len - ODOM_data.sv2_delta_len) / (MECP.tread);
    //ODOM_data.delta_theta_gyro = imu_data.gyro[Z_AXIS] / MOTION_CONTROL_FREQ;
    ODOM_data.delta_theta_gyro = vqf_gyro[2] / MOTION_CONTROL_FREQ;
    ODOM_data.delta_theta = ODOM_data.delta_theta_gyro;
#endif

    // ホイールの平均の移動量を求める
    // Vdt=R*ωdt、V1dt=(R+d)*ωdt、V2dt=(R-d)*ωdt
    // V1dt=Vdt+d*ωdt、V2dt=Vdt-d*ωdt
    // d*ωdt=(V1dt-Vdt)=(Vdt-V2dt)
    // Vdt=(V1dt+V2dt)/2
    ODOM_data.delta_len = (ODOM_data.sv1_delta_len + ODOM_data.sv2_delta_len) / 2.0f;

    // 自己移動量を計算する
    double pos_body_x = ODOM_data.delta_len * cos(BVC.pos_res[Z_AXIS] + ODOM_data.delta_theta / 2.0f);
    double pos_body_y = ODOM_data.delta_len * sin(BVC.pos_res[Z_AXIS] + ODOM_data.delta_theta / 2.0f);

    // ローカル座標系の自己位置を更新する
    BVC.pos_res[X_AXIS] += pos_body_x;
    BVC.pos_res[Y_AXIS] += pos_body_y;
    //BVC.pos_res[Z_AXIS] += ODOM_data.delta_theta;
#if 1
    //BVC.pos_res[Z_AXIS] = MC_CLIP_PI(BVC.pos_res[Z_AXIS] + ODOM_data.delta_theta);
    BVC.pos_res[Z_AXIS] = vqf_QuatToEulerZ(quat);
#else
    BVC.pos_res[Z_AXIS] = imu_data.theta[Z_AXIS];
#endif

