akinakano/RP2040_battery_control/App/Src/motion_controller.c
    // 速度はボディ座標系で返す
    //BVC.vel_res[X_AXIS] = ODOM_data.delta_len * MOTION_CONTROL_FREQ;
    //BVC.vel_res[Y_AXIS] = 0.0f;
    //BVC.vel_res[Z_AXIS] = ODOM_data.delta_theta * MOTION_CONTROL_FREQ;
    //BVC.vel_res[Z_AXIS] = imu_data.gyro[Z_AXIS];

    // 速度にLPFを掛ける
    const float x_vel_LPF_fc = 50.0f;
    const float z_vel_LPF_fc = 150.0f;
    //BVC.x_vel_res_LPF += (ODOM_data.delta_len * MOTION_CONTROL_FREQ - BVC.x_vel_res_LPF) * x_vel_LPF_fc / MOTION_CONTROL_FREQ;
    BVC.vel_res[X_AXIS] += (ODOM_data.delta_len - BVC.vel_res[X_AXIS] / MOTION_CONTROL_FREQ) * x_vel_LPF_fc;
    BVC.vel_res[Y_AXIS] = 0.0f;
#if 1
    BVC.vel_res[Z_AXIS] += (ODOM_data.delta_theta - BVC.vel_res[Z_AXIS] / MOTION_CONTROL_FREQ) * z_vel_LPF_fc; 
#else
    BVC.vel_res[Z_AXIS] += (imu_data.gyro[Z_AXIS] - BVC.vel_res[Z_AXIS]) * z_vel_LPF_fc / MOTION_CONTROL_FREQ; 
#endif

    // ************************************
    // 前後速度への指示値を修正
    // ************************************
    float x_error = BVC.pos_cmd[X_AXIS] - BVC.pos_res[X_AXIS];
    float y_error = BVC.pos_cmd[Y_AXIS] - BVC.pos_res[Y_AXIS];
    
    ODOM_data.x_error_body = x_error * cosf(-BVC.pos_res[Z_AXIS]) - y_error * sinf(-BVC.pos_res[Z_AXIS]);
    ODOM_data.y_error_body = x_error * sinf(-BVC.pos_res[Z_AXIS]) + y_error * cosf(-BVC.pos_res[Z_AXIS]);

#if 0
    const float vel_kp  = 8.0f;
    const float vel_kff = 0.0f;
#else
    const float vel_kp  = 4.0f;
    const float vel_kff = 1.0f;
#endif
    float vel_ref_ff_x = BVC.vel_cmd[X_AXIS] * vel_kff;

    BVC.vel_ref[X_AXIS] = ODOM_data.x_error_body * vel_kp + vel_ref_ff_x;

    //指示値リミット
    BVC.vel_ref[X_AXIS] = LIM_MIN_MAX(BVC.vel_ref[X_AXIS], - BODY_VX_LIMIT, BODY_VX_LIMIT);

    // ************************************
    // Yawの指示値を修正
    // ************************************
    //const float yaw_kp  = 14.0f;
    //const float yaw_kp  = 13.0f;
#if 0
    const float yaw_dp  = 0.0f;
    const float yaw_kp  = 14.0f;
    const float yaw_kff = 0.3f;
#else
    const float yaw_dp  = 10.0f;
    const float yaw_kp  = 10.0f;
    const float yaw_kff = 1.0f;
#endif

    float omega_adj = ODOM_data.y_error_body * yaw_dp;
    BVC.omega_ref_adj_y = (fabsf(BVC.vel_cmd[X_AXIS]) < 1.0 ? omega_adj * fabsf(BVC.vel_cmd[X_AXIS]) : omega_adj);

    float vel_ref_ff_z = BVC.vel_cmd[Z_AXIS] * yaw_kff;

#if 1
    //BVC.vel_ref[Z_AXIS] = (BVC.pos_cmd[Z_AXIS] - BVC.pos_res[Z_AXIS]) * yaw_kp + BVC.vel_cmd[Z_AXIS] * yaw_kff;
    BVC.vel_ref[Z_AXIS] = (MC_CLIP_PI(BVC.pos_cmd[Z_AXIS] - BVC.pos_res[Z_AXIS])) * yaw_kp + vel_ref_ff_z + BVC.omega_ref_adj_y;
#else
    if (vqf_GetRestDetected()){
        BVC.vel_ref[Z_AXIS] = 0.0f;
    } else {
        BVC.vel_ref[Z_AXIS] = (MC_CLIP_PI(BVC.pos_cmd[Z_AXIS] - BVC.pos_res[Z_AXIS])) * yaw_kp + vel_ref_ff_z + BVC.omega_ref_adj_y;
    }        
#endif

    //指示値リミット
    BVC.vel_ref[Z_AXIS] = LIM_MIN_MAX(BVC.vel_ref[Z_AXIS], - BODY_WZ_LIMIT, BODY_WZ_LIMIT);

#if 0
    // ************************************
    // Yawの空転検出
    // ************************************
    // Gyroとオドメトリの角速度差が一定以上
    if(fabsf(ODOM_data.delta_theta_odom) > (180.0f * SMC_PI_F / 180.0f / MOTION_CONTROL_FREQ)) {
        float over_dtheta = fabsf(ODOM_data.delta_theta_odom) - (180.0f * SMC_PI_F / 180.0f / MOTION_CONTROL_FREQ);
        ODOM_data.dtheta_ratio = (over_dtheta > (20.0f * SMC_PI_F / 180.0f / MOTION_CONTROL_FREQ) ? 0.0f :
                                  1.0f - (over_dtheta / 20.0f * SMC_PI_F / 180.0f / MOTION_CONTROL_FREQ));
    } else {
        ODOM_data.dtheta_ratio = 1.0f;
    }

    BVC.vel_ref[Z_AXIS] *= ODOM_data.dtheta_ratio;   
#endif

    // ************************************
    // VPOSの修正
    // ************************************
    if (vel_kp > 0.000001f){
#if 0
        BVC.pos_cmd[X_AXIS] = (BVC.vel_ref[X_AXIS] - vel_ref_ff_x) / vel_kp + BVC.pos_res[X_AXIS];
#else
        float x_error_body = (BVC.vel_ref[X_AXIS] - vel_ref_ff_x) / vel_kp;
        float x_error = x_error_body * cosf(BVC.pos_res[Z_AXIS]) - ODOM_data.y_error_body * sinf(BVC.pos_res[Z_AXIS]);
        float y_error = x_error_body * sinf(BVC.pos_res[Z_AXIS]) + ODOM_data.y_error_body * cosf(BVC.pos_res[Z_AXIS]);
        BVC.pos_cmd[X_AXIS] = x_error + BVC.pos_res[X_AXIS];
        BVC.pos_cmd[Y_AXIS] = y_error + BVC.pos_res[Y_AXIS];
#endif
    }

    if (vqf_GetRestDetected()){
        // 静止判定時は角速度の指示キープでVPOSの角度も修正しない
        //BVC.vel_ref[Z_AXIS] = 0.0f;
        BVC.vel_ref[Z_AXIS] = BVC.omega_ref_prev;

        // 静止直前の姿勢で上書き
        vqf_SetQuat( imu_data.gyro_quat, imu_data.acc_quat);
    }else if (yaw_kp > 0.000001f){
        //BVC.pos_cmd[Z_AXIS] = MC_CLIP_PI((BVC.vel_ref[Z_AXIS] - vel_ref_ff_z) / yaw_kp + BVC.pos_res[Z_AXIS]);
        BVC.pos_cmd[Z_AXIS] = MC_CLIP_PI((BVC.vel_ref[Z_AXIS] - vel_ref_ff_z - BVC.omega_ref_adj_y) / yaw_kp + BVC.pos_res[Z_AXIS]);

        // 姿勢情報を保存
        vqf_GetQuat( imu_data.gyro_quat, imu_data.acc_quat);
    }

    // 角速度指示を保存
    BVC.omega_ref_prev = BVC.vel_ref[Z_AXIS];
    // ************************************

    //制御処理
    //BodyVelocityControl_2();
    BodyVelocityControl_3();

    //SVへの指示
    int16_t cmd[COMM_SV_NUM] = {0, 0};
    uint8_t to_sv_mode[COMM_SV_NUM] = {TO_IDLE_MODE, TO_IDLE_MODE};
    const float acc_lpf_fc = 1.0f;
    const float gyro_lpf_fc = 1.0f;
    const float acc_max_calib_noise = 2.0f;     // m/s/s
    const float gyro_max_calib_noise = 0.02f;    // rad/s
    //const float gyro_max_calib_noise = 1.0f;    // rad/s

    // 停止指示なら問答無用にストップへステート遷移
    if(ApMpData[apmpBank].cmd == AP_MP_CMD_IDLE && (MC_state.state == MC_STATE_START || MC_state.state == MC_STATE_RUN)){
        MC_state.state = MC_STATE_STOP;
    }
    // ステート制御
    switch(MC_state.state){
        case MC_STATE_INIT: // 初期化
            imu_data.calib_count = 0;
            imu_data.calib_end = false;
            for (int i=0; i<3; i++) {
                imu_data.acc_bias[i] = imu_data.acc[i];
                imu_data.gyro_bias[i] = imu_data.gyro[i];
                imu_data.acc_min[i] = imu_data.acc[i];
                imu_data.gyro_min[i] = imu_data.gyro[i];
                imu_data.acc_max[i] = imu_data.acc[i];
                imu_data.gyro_max[i] = imu_data.gyro[i];
                //imu_data.theta[i] = 0.0f;
#if 0
                imu_data.gyro_scale_gain = 1.0f + (float)((int32_t)ApMpData[apmpBank].imu_gyro_scale_gain - 32768)*GYRO_SCALE_GAIN_INT16t_TO_FLOAT; //機体ごとのスケールゲインをAPからもらう
            }
            if(imu_data.gyro_scale_gain>1.1 || imu_data.gyro_scale_gain<0.9){
                imu_data.gyro_scale_gain = IMU_GYRO_SCALE_GAIN; //うまく受信できていなかったらデフォルト値で初期化
#endif
            }
            to_sv_mode[SV1_FR] = TO_IDLE_MODE;
            to_sv_mode[SV2_FL] = TO_IDLE_MODE;
            send_mode_broadcast_data(COMM_SV_NUM, to_sv_mode, MOTOR_TEMP);  //Initで明示的にSVを停止させる

            MC_state.state = MC_STATE_CALIB;
            break;
        case MC_STATE_CALIB:
            for (int i=0; i<3; i++) {
                imu_data.acc_bias[i] += (imu_data.acc[i] - imu_data.acc_bias[i]) * acc_lpf_fc / MOTION_CONTROL_FREQ;
                imu_data.gyro_bias[i] += (imu_data.gyro[i] - imu_data.gyro_bias[i]) * gyro_lpf_fc / MOTION_CONTROL_FREQ;
                //imu_data.theta[i] = 0.0f;

                if (imu_data.acc_min[i] > imu_data.acc[i]) {
                    imu_data.acc_min[i] = imu_data.acc[i];
                }
                if (imu_data.gyro_min[i] > imu_data.gyro[i]) {
                    imu_data.gyro_min[i] = imu_data.gyro[i];
                }
                if (imu_data.acc_max[i] < imu_data.acc[i]) {
                    imu_data.acc_max[i] = imu_data.acc[i];
                }
                if (imu_data.gyro_max[i] < imu_data.gyro[i]) {
                    imu_data.gyro_max[i] = imu_data.gyro[i];
                }

                if ((imu_data.acc_max[i] - imu_data.acc_min[i] > acc_max_calib_noise) ||
                    (imu_data.gyro_max[i] - imu_data.gyro_min[i] > gyro_max_calib_noise) ){
                    BVC.BVC_debug_flag |= FLAG_BVC_IMU_CALIB_ERR;
                    MC_state.state = MC_STATE_INIT;
                    break;
                }
            }

