akinakano/RP2040_battery_control/App/Src/motion_controller.c
            imu_data.calib_count++;

            if (imu_data.calib_count > MOTION_CONTROL_FREQ * 5){
                MC_state.state = MC_STATE_IDLE;
                imu_data.calib_end = true;
                to_sv_mode[SV1_FR] = TO_FORCE_MODE;
                to_sv_mode[SV2_FL] = TO_FORCE_MODE;
                send_mode_broadcast_data(COMM_SV_NUM, to_sv_mode, MOTOR_TEMP);
            }
            break;
        case MC_STATE_IDLE:
            cmd[SV1_FR] = 0;
            cmd[SV2_FL] = 0;
            //vqf_ResetQuat();
            send_cmd_broadcast_data(FORCE_CNTRL_ALL, COMM_SV_NUM, cmd, MOTOR_TEMP);
            if (imu_data.calib_end == false){
                MC_state.state = MC_STATE_INIT;
            } else if (ApMpData[apmpBank].cmd == AP_MP_CMD_RUN) {
                MC_state.state = MC_STATE_START;
            }
            break;
        case MC_STATE_START://SVを駆動モードに入れてStateをrunに変更する
#if 0 
            to_sv_mode[SV1_FR] = TO_VEL_MODE;
            to_sv_mode[SV2_FL] = TO_VEL_MODE;
            // to_sv_mode[SV3_HR] = TO_VEL_MODE;
            // to_sv_mode[SV4_HL] = TO_VEL_MODE;
#elif 0     //サーボオフにしてオドメトリ確認したいときは0にする 
            to_sv_mode[SV1_FR] = TO_FORCE_MODE;
            to_sv_mode[SV2_FL] = TO_FORCE_MODE;

#else

#endif

            // APから受け取ったメカパラメータの取り込み
            MECP.wheel_radius_r = ((float)ApMpData[apmpBank].wheel_radius_right) / 1000000.0f;
            MECP.wheel_radius_l = ((float)ApMpData[apmpBank].wheel_radius_left ) / 1000000.0f;
            MECP.tread =          ((float)ApMpData[apmpBank].tread )             / 100000.0f;
            imu_data.gyro_scale_gain = 1.0f + ((float)((int32_t)(ApMpData[apmpBank].imu_gyro_scale_gain)) - 32768) * GYRO_SCALE_GAIN_INT16t_TO_FLOAT; //機体ごとのスケールゲインをAPからもらう
            //send_mode_broadcast_data(mode_mp_sv, COMM_SV_NUM, to_sv_mode, MOTOR_TEMP);
            MC_state.state = MC_STATE_RUN;
            break;
        case MC_STATE_RUN:
#if 0
            //cmd[SV1_FR] = (int16_t)(35);  //for debug
            //cmd[SV2_FL] = (int16_t)(35);  //for debug
            cmd[SV1_FR] = (int16_t)(BVC.v_ref[SV1_FR] * 100); //[0.01Hz]
            cmd[SV2_FL] = (int16_t)(BVC.v_ref[SV2_FL] * 100); //[0.01Hz]
            // cmd[SV3_HR] = (int16_t)(BVC.i_ref[SV3_HR] * 32767.0f / 25.0f);
            // cmd[SV4_HL] = (int16_t)(BVC.i_ref[SV4_HL] * 32767.0f / 25.0f);
            send_cmd_broadcast_data(cmd_mp_sv, VEL_CNTRL_ALL, COMM_SV_NUM, cmd, MOTOR_TEMP);
#else
 #if 0
            // 本当は速度ではなくトルク的なものを送る
            cmd[SV1_FR] = (int16_t)(BVC.v_ref[SV1_FR] * 1000); //[0.01Hz]
            cmd[SV2_FL] = (int16_t)(BVC.v_ref[SV2_FL] * 1000); //[0.01Hz]
 #else
            // 本当は速度ではなくトルク的なものを送る
            cmd[SV1_FR] = (int16_t)(BVC.t_ref[SV1_FR] * 10000.0f); //[1mNm]
            cmd[SV2_FL] = (int16_t)(BVC.t_ref[SV2_FL] * 10000.0f); //[1mNm]
#endif
            send_cmd_broadcast_data(FORCE_CNTRL_ALL, COMM_SV_NUM, cmd, MOTOR_TEMP);
#endif
            break;
        case MC_STATE_STOP:
            to_sv_mode[SV1_FR] = TO_IDLE_MODE;
            to_sv_mode[SV2_FL] = TO_IDLE_MODE;
            // to_sv_mode[SV3_HR] = TO_IDLE_MODE;
            // to_sv_mode[SV4_HL] = TO_IDLE_MODE;
            send_mode_broadcast_data(COMM_SV_NUM, to_sv_mode, MOTOR_TEMP);
            //MC_state.state = MC_STATE_IDLE;
            MC_state.state = MC_STATE_INIT;
            break;
    }

    // if(comm_sv_err_cnt > 0){
    //     comm_sv_err_cnt--;
    // }
    

    MC_state.time_count++;
    if(MC_state.time_count % 16 == 0){
        send_data_on_mp_to_ap();//send start
    }

 //   TEST_PF9(0);
}


void BodyVelocityControl_3(void){
    static int last_state = MC_STATE_IDLE;

    if(MC_state.state != MC_STATE_RUN){
        // 速度指示値
        BVC.vel_cmd_raw[X_AXIS] = 0.0f;
        BVC.vel_cmd_raw[Y_AXIS] = 0.0f;
        BVC.vel_cmd_raw[Z_AXIS] = 0.0f;
        BVC.vel_cmd[X_AXIS] = 0.0f;
        BVC.vel_cmd[Y_AXIS] = 0.0f;
        BVC.vel_cmd[Z_AXIS] = 0.0f;
        BVC.vel_cmd_dbg[X_AXIS] = 0.0f;
        BVC.vel_cmd_dbg[Y_AXIS] = 0.0f;
        BVC.vel_cmd_dbg[Z_AXIS] = 0.0f;
        BVC.vel_ref[X_AXIS] = 0.0f;
        BVC.vel_ref[Y_AXIS] = 0.0f;
        BVC.vel_ref[Z_AXIS] = 0.0f;
        BVC.vel_res[X_AXIS] = 0.0f;
        BVC.vel_res[Y_AXIS] = 0.0f;
        BVC.vel_res[Z_AXIS] = 0.0f;
        BVC.vel_res_z1[X_AXIS] = 0.0f;
        BVC.vel_res_z1[Y_AXIS] = 0.0f;
        BVC.vel_res_z1[Z_AXIS] = 0.0f;
        BVC.pos_cmd[X_AXIS] = 0.0f;
        BVC.pos_cmd[Y_AXIS] = 0.0f;
        BVC.pos_cmd[Z_AXIS] = 0.0f;
        BVC.pos_res[X_AXIS] = 0.0f;
        BVC.pos_res[Y_AXIS] = 0.0f;
        BVC.pos_res[Z_AXIS] = 0.0f;
        BVC.acc_lpf[Z_AXIS] = 0.0f;
        BVC.acc_dis_lpf[X_AXIS] = 0.0f;
        BVC.acc_dis_lpf[Y_AXIS] = 0.0f;
        BVC.acc_dis_lpf[Z_AXIS] = 0.0f;
        vqf_ResetQuat();
        //return;
    }
    else {
        static float x_vel_i_sum = 0.0f;
        static float z_vel_i_sum = 0.0f;
        
        if(last_state != MC_STATE_RUN){
            x_vel_i_sum = 0;
            z_vel_i_sum = 0;
        }

        const float pid_vel_x_kp = 150.0f;
        const float pid_vel_x_ki = 0.0f / MOTION_CONTROL_FREQ;

        const float pid_vel_z_kp = 250.0f;
        const float pid_vel_z_ki = 0.0f / MOTION_CONTROL_FREQ;

#if 1
        // 速度制御
        float x_vel_err = BVC.vel_ref[X_AXIS] - BVC.vel_res[X_AXIS];
        float z_vel_err = BVC.vel_ref[Z_AXIS] - BVC.vel_res[Z_AXIS];

        // 積分
        float x_vel_i = x_vel_err * pid_vel_x_ki;
        float z_vel_i = z_vel_err * pid_vel_z_ki;

        // 加速度を計算
        float x_acc = x_vel_err * pid_vel_x_kp + x_vel_i + x_vel_i_sum;
        float z_acc = z_vel_err * pid_vel_z_kp + z_vel_i + z_vel_i_sum;

        float x_force = x_acc * BODY_WEIGHT;                        // F = ma
        float z_force = z_acc * BODY_Z_INERTIA / (MECP.tread / 2.0f);  // T = ω'I、F = T / L

        // それぞれのホイールに掛かる力を算出
        float SV1_force = (x_force + z_force) / 2.0f;
        float SV2_force = (x_force - z_force) / 2.0f;

        const float max_force = 20.0f;     // N
        //const float max_force = 30.0f;     // N
        //const float max_force = 15.0f;

        // 力リミット時に積分が増加方向なら積分しない
        x_vel_i_sum = ((fabsf(SV1_force) > max_force || fabsf(SV2_force) > max_force) && (x_acc * x_vel_i > 0.0f) ? x_vel_i_sum : x_vel_i + x_vel_i_sum);
        z_vel_i_sum = ((fabsf(SV1_force) > max_force || fabsf(SV2_force) > max_force) && (z_acc * z_vel_i > 0.0f) ? z_vel_i_sum : z_vel_i + z_vel_i_sum);
#else
        const float max_force = 20.0f;     // N
        //const float max_force = 30.0f;     // N
        //const float max_force = 15.0f;

