akinakano/RP2040_battery_control/App/Src/motion_controller.c
        float SV1_force;
        float SV2_force;

        if (vqf_GetRestDetected()){
            SV1_force = 0.0f;
            SV2_force = 0.0f;
            x_vel_i_sum = 0.0f;
            z_vel_i_sum = 0.0f;
        } else {
            // 速度制御
            float x_vel_err = BVC.vel_ref[X_AXIS] - BVC.vel_res[X_AXIS];
            float z_vel_err = BVC.vel_ref[Z_AXIS] - BVC.vel_res[Z_AXIS];

            // 積分
            float x_vel_i = x_vel_err * pid_vel_x_ki;
            float z_vel_i = z_vel_err * pid_vel_z_ki;

            // 加速度を計算
            float x_acc = x_vel_err * pid_vel_x_kp + x_vel_i + x_vel_i_sum;
            float z_acc = z_vel_err * pid_vel_z_kp + z_vel_i + z_vel_i_sum;

            float x_force = x_acc * BODY_WEIGHT;                        // F = ma
            float z_force = z_acc * BODY_Z_INERTIA / (MECP.tread / 2.0f);  // T = ω'I、F = T / L

            // それぞれのホイールに掛かる力を算出
            SV1_force = (x_force + z_force) / 2.0f;
            SV2_force = (x_force - z_force) / 2.0f;

            // 力リミット時に積分が増加方向なら積分しない
            x_vel_i_sum = ((fabsf(SV1_force) > max_force || fabsf(SV2_force) > max_force) && (x_acc * x_vel_i > 0.0f) ? x_vel_i_sum : x_vel_i + x_vel_i_sum);
            z_vel_i_sum = ((fabsf(SV1_force) > max_force || fabsf(SV2_force) > max_force) && (z_acc * z_vel_i > 0.0f) ? z_vel_i_sum : z_vel_i + z_vel_i_sum);
        }
#endif

#if 0
        // ホイールに掛かる力リミット
        SV1_force = LIM_MIN_MAX(SV1_force, - max_force, max_force);
        SV2_force = LIM_MIN_MAX(SV2_force, - max_force, max_force);
#else
        // ホイールに掛かる力を左右別々にリミット
        float over_force1 = 0.0f;
        float over_force2 = 0.0f;

        if (SV1_force - max_force > over_force1) {
            over_force1 = SV1_force - max_force;
            BVC.BVC_debug_flag |= FLAG_BVC_LIM_MOT_TORQUE_R;
        } else if (SV1_force + max_force < over_force1){
            over_force1 = SV1_force + max_force;
            BVC.BVC_debug_flag |= FLAG_BVC_LIM_MOT_TORQUE_R;
        }

        if (SV2_force - max_force > over_force2) {
            over_force2 = SV2_force - max_force;
            BVC.BVC_debug_flag |= FLAG_BVC_LIM_MOT_TORQUE_L;
        } else if (SV2_force + max_force < over_force2){
            over_force2 = SV2_force + max_force;
            BVC.BVC_debug_flag |= FLAG_BVC_LIM_MOT_TORQUE_L;
        }

        SV1_force -= over_force1;
        SV2_force -= over_force2;
#endif

        // 力変化量リミット
        const float max_delta_force = 1000.0f;     // N/s
        ODOM_data.SV1_force = MC_DELTA_LIMIT(ODOM_data.SV1_force, SV1_force, max_delta_force / MOTION_CONTROL_FREQ);
        ODOM_data.SV2_force = MC_DELTA_LIMIT(ODOM_data.SV2_force, SV2_force, max_delta_force / MOTION_CONTROL_FREQ);

        // 力をトルクに変換
        BVC.t_ref[SV1_FR] = ODOM_data.SV1_force * MECP.wheel_radius_r * SV1_DIRECTION;
        BVC.t_ref[SV2_FL] = ODOM_data.SV2_force * MECP.wheel_radius_l * SV2_DIRECTION;
    }
    last_state = MC_state.state;
    
    if(vqf_GetRestDetected()){  //静止判定フラグ
        BVC.BVC_debug_flag |= FLAG_BVC_REST_DETECT;
    }
}

void BodyVelocityControl_2(void){
    if(MC_state.state != MC_STATE_RUN){
        // 速度指示値
        BVC.vel_cmd[X_AXIS] = 0.0f;
        BVC.vel_cmd[Y_AXIS] = 0.0f;
        BVC.vel_cmd[Z_AXIS] = 0.0f;
        BVC.vel_cmd_dbg[X_AXIS] = 0.0f;
        BVC.vel_cmd_dbg[Y_AXIS] = 0.0f;
        BVC.vel_cmd_dbg[Z_AXIS] = 0.0f;
        BVC.vel_ref[X_AXIS] = 0.0f;
        BVC.vel_ref[Y_AXIS] = 0.0f;
        BVC.vel_ref[Z_AXIS] = 0.0f;
        BVC.vel_res[X_AXIS] = 0.0f;
        BVC.vel_res[Y_AXIS] = 0.0f;
        BVC.vel_res[Z_AXIS] = 0.0f;
        BVC.vel_res_z1[X_AXIS] = 0.0f;
        BVC.vel_res_z1[Y_AXIS] = 0.0f;
        BVC.vel_res_z1[Z_AXIS] = 0.0f;
        BVC.pos_res[X_AXIS] = 0.0f;
        BVC.pos_res[Y_AXIS] = 0.0f;
        BVC.pos_res[Z_AXIS] = 0.0f;
        BVC.acc_lpf[Z_AXIS] = 0.0f;
        BVC.acc_dis_lpf[X_AXIS] = 0.0f;
        BVC.acc_dis_lpf[Y_AXIS] = 0.0f;
        BVC.acc_dis_lpf[Z_AXIS] = 0.0f;
        return;
    }
    //APからの速度の指令値(m/s)を左右の車輪角速度(rad/s)->[Hz]に変換
    BVC.v_ref[SV1_FR] = (BVC.vel_ref[X_AXIS] + (MECP.tread/2.0f)*BVC.vel_ref[Z_AXIS])/(2*MECP.wheel_radius_r)/(SMC_PI_F)*SV1_DIRECTION;   //右車輪
    BVC.v_ref[SV2_FL] = (BVC.vel_ref[X_AXIS] - (MECP.tread/2.0f)*BVC.vel_ref[Z_AXIS])/(2*MECP.wheel_radius_l)/(SMC_PI_F)*SV2_DIRECTION;   //左車輪
}

void BodyVelocityControl(void){
    if(MC_state.state != MC_STATE_RUN){
        // 速度指示値
        BVC.vel_cmd[X_AXIS] = 0.0f;
        BVC.vel_cmd[Y_AXIS] = 0.0f;
        BVC.vel_cmd[Z_AXIS] = 0.0f;
        BVC.vel_cmd_dbg[X_AXIS] = 0.0f;
        BVC.vel_cmd_dbg[Y_AXIS] = 0.0f;
        BVC.vel_cmd_dbg[Z_AXIS] = 0.0f;
        BVC.vel_res[X_AXIS] = 0.0f;
        BVC.vel_res[Y_AXIS] = 0.0f;
        BVC.vel_res[Z_AXIS] = 0.0f;
        BVC.vel_res_z1[X_AXIS] = 0.0f;
        BVC.vel_res_z1[Y_AXIS] = 0.0f;
        BVC.vel_res_z1[Z_AXIS] = 0.0f;
        // BVC.pos_res[X_AXIS] = 0.0f;
        // BVC.pos_res[Y_AXIS] = 0.0f;
        // BVC.pos_res[Z_AXIS] = 0.0f;
        BVC.acc_lpf[Z_AXIS] = 0.0f;
        BVC.acc_dis_lpf[X_AXIS] = 0.0f;
        BVC.acc_dis_lpf[Y_AXIS] = 0.0f;
        BVC.acc_dis_lpf[Z_AXIS] = 0.0f;
        return;
    }

    // 関節角速度応答値
    BVC.dq_res[SV1_FR] = sv_res[SV1_FR].vel_res * SV1_DIRECTION;
    BVC.dq_res[SV2_FL] = sv_res[SV2_FL].vel_res * SV2_DIRECTION;
    //BVC.dq_res[SV3_HR] = sv_res[SV3_HR].vel_res * SV3_DIRECTION;
    //BVC.dq_res[SV4_HL] = sv_res[SV4_HL].vel_res * SV4_DIRECTION;

#if (HW_WHEEL == HW_WHEEL_MECANUM)
    // ヤコビ計算
    //ヤコビ
    float jaco_k = 0.25f * WHEEL_RADIUS;
    float jaco_l = BODY_HALF_LENGTH_X + BODY_HALF_LENGTH_Y;
    BVC.Jaco[X_AXIS][SV1_FR] = jaco_k;
    BVC.Jaco[X_AXIS][SV2_FL] = jaco_k;
    BVC.Jaco[X_AXIS][SV3_HR] = jaco_k;
    BVC.Jaco[X_AXIS][SV4_HL] = jaco_k;
    BVC.Jaco[Y_AXIS][SV1_FR] = - jaco_k;
    BVC.Jaco[Y_AXIS][SV2_FL] = jaco_k;
    BVC.Jaco[Y_AXIS][SV3_HR] = jaco_k;
    BVC.Jaco[Y_AXIS][SV4_HL] = - jaco_k;
    BVC.Jaco[Z_AXIS][SV1_FR] = jaco_k / jaco_l;
    BVC.Jaco[Z_AXIS][SV2_FL] = - jaco_k / jaco_l;
    BVC.Jaco[Z_AXIS][SV3_HR] = jaco_k / jaco_l;
    BVC.Jaco[Z_AXIS][SV4_HL] = - jaco_k / jaco_l;

    // ヤコビ逆
    float inv_jaco_k = 1.0f / WHEEL_RADIUS;
    BVC.invJaco[SV1_FR][X_AXIS] = inv_jaco_k;
    BVC.invJaco[SV1_FR][Y_AXIS] = - inv_jaco_k;
    BVC.invJaco[SV1_FR][Z_AXIS] = jaco_l* inv_jaco_k;
    BVC.invJaco[SV2_FL][X_AXIS] = inv_jaco_k;
    BVC.invJaco[SV2_FL][Y_AXIS] = inv_jaco_k;
    BVC.invJaco[SV2_FL][Z_AXIS] = - jaco_l* inv_jaco_k;
    BVC.invJaco[SV3_HR][X_AXIS] = inv_jaco_k;
    BVC.invJaco[SV3_HR][Y_AXIS] = inv_jaco_k;
    BVC.invJaco[SV3_HR][Z_AXIS] = jaco_l* inv_jaco_k;
    BVC.invJaco[SV4_HL][X_AXIS] = inv_jaco_k;
    BVC.invJaco[SV4_HL][Y_AXIS] = - inv_jaco_k;
    BVC.invJaco[SV4_HL][Z_AXIS] = - jaco_l* inv_jaco_k;

    // ヤコビ転置
    BVC.transJaco[SV1_FR][X_AXIS] = BVC.Jaco[X_AXIS][SV1_FR];
    BVC.transJaco[SV1_FR][Y_AXIS] = BVC.Jaco[Y_AXIS][SV1_FR];
    BVC.transJaco[SV1_FR][Z_AXIS] = BVC.Jaco[Z_AXIS][SV1_FR];
    BVC.transJaco[SV2_FL][X_AXIS] = BVC.Jaco[X_AXIS][SV2_FL];
    BVC.transJaco[SV2_FL][Y_AXIS] = BVC.Jaco[Y_AXIS][SV2_FL];
    BVC.transJaco[SV2_FL][Z_AXIS] = BVC.Jaco[Z_AXIS][SV2_FL];
    BVC.transJaco[SV3_HR][X_AXIS] = BVC.Jaco[X_AXIS][SV3_HR];
    BVC.transJaco[SV3_HR][Y_AXIS] = BVC.Jaco[Y_AXIS][SV3_HR];
    BVC.transJaco[SV3_HR][Z_AXIS] = BVC.Jaco[Z_AXIS][SV3_HR];
    BVC.transJaco[SV4_HL][X_AXIS] = BVC.Jaco[X_AXIS][SV4_HL];
    BVC.transJaco[SV4_HL][Y_AXIS] = BVC.Jaco[Y_AXIS][SV4_HL];
    BVC.transJaco[SV4_HL][Z_AXIS] = BVC.Jaco[Z_AXIS][SV4_HL];
    //ヤコビ転置逆

    //速度応答値 //低域をモータ角速度、高域をIMUを使ったフュージョン処理をつくる予定
    BVC.vel_res[X_AXIS] = BVC.Jaco[X_AXIS][SV1_FR] * BVC.dq_res[SV1_FR] + BVC.Jaco[X_AXIS][SV2_FL] * BVC.dq_res[SV2_FL] + BVC.Jaco[X_AXIS][SV3_HR] * BVC.dq_res[SV3_HR] + BVC.Jaco[X_AXIS][SV4_HL] * BVC.dq_res[SV4_HL];
    BVC.vel_res[Y_AXIS] = BVC.Jaco[Y_AXIS][SV1_FR] * BVC.dq_res[SV1_FR] + BVC.Jaco[Y_AXIS][SV2_FL] * BVC.dq_res[SV2_FL] + BVC.Jaco[Y_AXIS][SV3_HR] * BVC.dq_res[SV3_HR] + BVC.Jaco[Y_AXIS][SV4_HL] * BVC.dq_res[SV4_HL];
    BVC.vel_res[Z_AXIS] = BVC.Jaco[Z_AXIS][SV1_FR] * BVC.dq_res[SV1_FR] + BVC.Jaco[Z_AXIS][SV2_FL] * BVC.dq_res[SV2_FL] + BVC.Jaco[Z_AXIS][SV3_HR] * BVC.dq_res[SV3_HR] + BVC.Jaco[Z_AXIS][SV4_HL] * BVC.dq_res[SV4_HL];
    //BVC.vel_res[Z_AXIS] = imu_data.gyro[Z_AXIS];

    //位置応答値
    BVC.pos_res[X_AXIS] += (cosf(BVC.pos_res[Z_AXIS]) * (BVC.vel_res[X_AXIS] + BVC.vel_res_z1[X_AXIS]) + sinf(BVC.pos_res[Z_AXIS]) * (BVC.vel_res[Y_AXIS] + BVC.vel_res_z1[Y_AXIS])) * 0.5f / MOTION_CONTROL_FREQ;
    BVC.pos_res[Y_AXIS] += (sinf(BVC.pos_res[Z_AXIS]) * (BVC.vel_res[X_AXIS] + BVC.vel_res_z1[X_AXIS]) - cosf(BVC.pos_res[Z_AXIS]) * (BVC.vel_res[Y_AXIS] + BVC.vel_res_z1[Y_AXIS])) * 0.5f / MOTION_CONTROL_FREQ;;
    BVC.pos_res[Z_AXIS] += (BVC.vel_res[Z_AXIS] + BVC.vel_res_z1[Z_AXIS]) * 0.5f / MOTION_CONTROL_FREQ;

    BVC.vel_res_z1[X_AXIS] = BVC.vel_res[X_AXIS];
    BVC.vel_res_z1[Y_AXIS] = BVC.vel_res[Y_AXIS];
    BVC.vel_res_z1[Z_AXIS] = BVC.vel_res[Z_AXIS];

    //作業空間オブザーバ //あとで試してみる予定 //ふらふらする
    // BVC.acc_res[X_AXIS] = imu_data.acc[X_AXIS];
    // BVC.acc_res[Y_AXIS] = - imu_data.acc[Y_AXIS];
    // BVC.acc_res[Z_AXIS] = (imu_data.gyro[Z_AXIS] - BVC.acc_lpf[Z_AXIS]) * BVC.omega_wob;
    // BVC.acc_lpf[Z_AXIS] += 0.5f * 1.0f / MOTION_CONTROL_FREQ * (BVC.acc_res[Z_AXIS] + BVC.acc_res_z1[Z_AXIS]);
    // BVC.acc_res_z1[Z_AXIS] = BVC.acc_res[Z_AXIS];

    // BVC.acc_dis[X_AXIS] = BVC.acc_ref[X_AXIS] - BVC.acc_res[X_AXIS];
    // BVC.acc_dis[Y_AXIS] = BVC.acc_ref[Y_AXIS] - BVC.acc_res[Y_AXIS];
    // BVC.acc_dis[Z_AXIS] = BVC.acc_ref[Z_AXIS] - BVC.acc_res[Z_AXIS];

    // BVC.dot_acc_dis[X_AXIS] = (BVC.acc_dis[X_AXIS] - BVC.acc_dis_lpf[X_AXIS]) * BVC.omega_wob;
    // BVC.acc_dis_lpf[X_AXIS] += 0.5f * 1.0f / MOTION_CONTROL_FREQ * (BVC.dot_acc_dis[X_AXIS] + BVC.dot_acc_dis_z1[X_AXIS]);
    // BVC.dot_acc_dis_z1[X_AXIS] = BVC.dot_acc_dis[X_AXIS];

