akinakano/RP2040_battery_control/App/Src/motion_controller.c
    // BVC.dot_acc_dis[Y_AXIS] = (BVC.acc_dis[Y_AXIS] - BVC.acc_dis_lpf[Y_AXIS]) * BVC.omega_wob;
    // BVC.acc_dis_lpf[Y_AXIS] += 0.5f * 1.0f / MOTION_CONTROL_FREQ * (BVC.dot_acc_dis[Y_AXIS] + BVC.dot_acc_dis_z1[Y_AXIS]);
    // BVC.dot_acc_dis_z1[Y_AXIS] = BVC.dot_acc_dis[Y_AXIS];

    // BVC.dot_acc_dis[Z_AXIS] = (BVC.acc_dis[Z_AXIS] - BVC.acc_dis_lpf[Z_AXIS]) * BVC.omega_wob;
    // BVC.acc_dis_lpf[Z_AXIS] += 0.5f * 1.0f / MOTION_CONTROL_FREQ * (BVC.dot_acc_dis[Z_AXIS] + BVC.dot_acc_dis_z1[Z_AXIS]);
    // BVC.dot_acc_dis_z1[Z_AXIS] = BVC.dot_acc_dis[Z_AXIS];

    //制御計算
    BVC.acc_ref[X_AXIS] = BVC.kp[X_AXIS] * (BVC.vel_cmd[X_AXIS] - BVC.vel_res[X_AXIS]);// + BVC.acc_dis_lpf[X_AXIS];
    BVC.acc_ref[Y_AXIS] = BVC.kp[Y_AXIS] * (BVC.vel_cmd[Y_AXIS] - BVC.vel_res[Y_AXIS]);// + BVC.acc_dis_lpf[Y_AXIS];
    BVC.acc_ref[Z_AXIS] = BVC.kp[Z_AXIS] * (BVC.vel_cmd[Z_AXIS] - BVC.vel_res[Z_AXIS]);// + BVC.acc_dis_lpf[Z_AXIS];//zだけ補償


    //分解加速度制御 ヤコビが定数なのでヤコビ時間微分が0
    BVC.ddq_ref[SV1_FR] = BVC.invJaco[SV1_FR][X_AXIS] * BVC.acc_ref[X_AXIS] + BVC.invJaco[SV1_FR][Y_AXIS] * BVC.acc_ref[Y_AXIS] + BVC.invJaco[SV1_FR][Z_AXIS] * BVC.acc_ref[Z_AXIS];
    BVC.ddq_ref[SV2_FL] = BVC.invJaco[SV2_FL][X_AXIS] * BVC.acc_ref[X_AXIS] + BVC.invJaco[SV2_FL][Y_AXIS] * BVC.acc_ref[Y_AXIS] + BVC.invJaco[SV2_FL][Z_AXIS] * BVC.acc_ref[Z_AXIS];
    BVC.ddq_ref[SV3_HR] = BVC.invJaco[SV3_HR][X_AXIS] * BVC.acc_ref[X_AXIS] + BVC.invJaco[SV3_HR][Y_AXIS] * BVC.acc_ref[Y_AXIS] + BVC.invJaco[SV3_HR][Z_AXIS] * BVC.acc_ref[Z_AXIS];
    BVC.ddq_ref[SV4_HL] = BVC.invJaco[SV4_HL][X_AXIS] * BVC.acc_ref[X_AXIS] + BVC.invJaco[SV4_HL][Y_AXIS] * BVC.acc_ref[Y_AXIS] + BVC.invJaco[SV4_HL][Z_AXIS] * BVC.acc_ref[Z_AXIS];


    //指示値
    BVC.tau_ref[SV1_FR] = BVC.ddq_ref[SV1_FR] * MOTOR_INERTIA;
    BVC.tau_ref[SV2_FL] = BVC.ddq_ref[SV2_FL] * MOTOR_INERTIA;
    BVC.tau_ref[SV3_HR] = BVC.ddq_ref[SV3_HR] * MOTOR_INERTIA;
    BVC.tau_ref[SV4_HL] = BVC.ddq_ref[SV4_HL] * MOTOR_INERTIA;


    BVC.i_ref[SV1_FR] = BVC.tau_ref[SV1_FR] / MOTOR_TORQUE_CONSTANT * SV1_DIRECTION;
    BVC.i_ref[SV2_FL] = BVC.tau_ref[SV2_FL] / MOTOR_TORQUE_CONSTANT * SV2_DIRECTION;
    BVC.i_ref[SV3_HR] = BVC.tau_ref[SV3_HR] / MOTOR_TORQUE_CONSTANT * SV3_DIRECTION;
    BVC.i_ref[SV4_HL] = BVC.tau_ref[SV4_HL] / MOTOR_TORQUE_CONSTANT * SV4_DIRECTION;

    for(int i = 0; i < 4; i++){
        if(BVC.i_ref[i] > MOTOR_CURRENT_LIMIT){
            BVC.i_ref[i] = MOTOR_CURRENT_LIMIT;
        }else if(BVC.i_ref[i] < - MOTOR_CURRENT_LIMIT){
            BVC.i_ref[i] = - MOTOR_CURRENT_LIMIT;
        }
    }
#elif (HW_WHEEL == HW_WHEEL_DIFF)
        // ヤコビ計算
    //ヤコビ
    float jaco_k = 0.5f * WHEEL_RADIUS;//0.5r
    float jaco_l = 2.0f * BODY_HALF_LENGTH_Y;//w
    BVC.Jaco[X_AXIS][SV1_FR] = jaco_k;
    BVC.Jaco[X_AXIS][SV2_FL] = jaco_k;
    BVC.Jaco[Y_AXIS][SV1_FR] = 0.0f;
    BVC.Jaco[Y_AXIS][SV2_FL] = 0.0f;
    BVC.Jaco[Z_AXIS][SV1_FR] = 2.0f * jaco_k / jaco_l;
    BVC.Jaco[Z_AXIS][SV2_FL] = - 2.0f * jaco_k / jaco_l;

    // ヤコビ逆
    float inv_jaco_k = 1.0f / WHEEL_RADIUS;//1/r
    BVC.invJaco[SV1_FR][X_AXIS] = inv_jaco_k;
    BVC.invJaco[SV1_FR][Y_AXIS] = 0.0f;
    BVC.invJaco[SV1_FR][Z_AXIS] = BODY_HALF_LENGTH_Y * inv_jaco_k;
    BVC.invJaco[SV2_FL][X_AXIS] = inv_jaco_k;
    BVC.invJaco[SV2_FL][Y_AXIS] = 0.0f;
    BVC.invJaco[SV2_FL][Z_AXIS] = - BODY_HALF_LENGTH_Y * inv_jaco_k;


    //ヤコビ転置逆

    //速度応答値 //低域をモータ角速度、高域をIMUを使ったフュージョン処理をつくる予定
    BVC.vel_res[X_AXIS] = BVC.Jaco[X_AXIS][SV1_FR] * BVC.dq_res[SV1_FR] + BVC.Jaco[X_AXIS][SV2_FL] * BVC.dq_res[SV2_FL];
    BVC.vel_res[Y_AXIS] = 0.0f;
    BVC.vel_res[Z_AXIS] = BVC.Jaco[Z_AXIS][SV1_FR] * BVC.dq_res[SV1_FR] + BVC.Jaco[Z_AXIS][SV2_FL] * BVC.dq_res[SV2_FL];
    //BVC.vel_res[Z_AXIS] = imu_data.gyro[Z_AXIS];

    //位置応答値
    BVC.pos_res[X_AXIS] += (cosf(BVC.pos_res[Z_AXIS]) * (BVC.vel_res[X_AXIS] + BVC.vel_res_z1[X_AXIS])) * 0.5f / MOTION_CONTROL_FREQ;
    BVC.pos_res[Y_AXIS] += (sinf(BVC.pos_res[Z_AXIS]) * (BVC.vel_res[X_AXIS] + BVC.vel_res_z1[X_AXIS])) * 0.5f / MOTION_CONTROL_FREQ;
    BVC.pos_res[Z_AXIS] += (BVC.vel_res[Z_AXIS] + BVC.vel_res_z1[Z_AXIS]) * 0.5f / MOTION_CONTROL_FREQ;

    if(BVC.pos_res[Z_AXIS] > 2.0f * 3.14159265358979f){
        BVC.pos_res[Z_AXIS] = BVC.pos_res[Z_AXIS] - 4.0f * 3.14159265358979f;
    }else if(BVC.pos_res[Z_AXIS] < - 2.0f * 3.14159265358979f){
        BVC.pos_res[Z_AXIS] = BVC.pos_res[Z_AXIS] + 4.0f * 3.14159265358979f;
    }

    BVC.vel_res_z1[X_AXIS] = BVC.vel_res[X_AXIS];
    BVC.vel_res_z1[Y_AXIS] = BVC.vel_res[Y_AXIS];
    BVC.vel_res_z1[Z_AXIS] = BVC.vel_res[Z_AXIS];

    //作業空間オブザーバ //あとで試してみる予定 //ふらふらする
    // BVC.acc_res[X_AXIS] = imu_data.acc[X_AXIS];
    // BVC.acc_res[Y_AXIS] = - imu_data.acc[Y_AXIS];
    // BVC.acc_res[Z_AXIS] = (imu_data.gyro[Z_AXIS] - BVC.acc_lpf[Z_AXIS]) * BVC.omega_wob;
    // BVC.acc_lpf[Z_AXIS] += 0.5f * 1.0f / MOTION_CONTROL_FREQ * (BVC.acc_res[Z_AXIS] + BVC.acc_res_z1[Z_AXIS]);
    // BVC.acc_res_z1[Z_AXIS] = BVC.acc_res[Z_AXIS];

    // BVC.acc_dis[X_AXIS] = BVC.acc_ref[X_AXIS] - BVC.acc_res[X_AXIS];
    // BVC.acc_dis[Y_AXIS] = BVC.acc_ref[Y_AXIS] - BVC.acc_res[Y_AXIS];
    // BVC.acc_dis[Z_AXIS] = BVC.acc_ref[Z_AXIS] - BVC.acc_res[Z_AXIS];

    // BVC.dot_acc_dis[X_AXIS] = (BVC.acc_dis[X_AXIS] - BVC.acc_dis_lpf[X_AXIS]) * BVC.omega_wob;
    // BVC.acc_dis_lpf[X_AXIS] += 0.5f * 1.0f / MOTION_CONTROL_FREQ * (BVC.dot_acc_dis[X_AXIS] + BVC.dot_acc_dis_z1[X_AXIS]);
    // BVC.dot_acc_dis_z1[X_AXIS] = BVC.dot_acc_dis[X_AXIS];

    // BVC.dot_acc_dis[Y_AXIS] = (BVC.acc_dis[Y_AXIS] - BVC.acc_dis_lpf[Y_AXIS]) * BVC.omega_wob;
    // BVC.acc_dis_lpf[Y_AXIS] += 0.5f * 1.0f / MOTION_CONTROL_FREQ * (BVC.dot_acc_dis[Y_AXIS] + BVC.dot_acc_dis_z1[Y_AXIS]);
    // BVC.dot_acc_dis_z1[Y_AXIS] = BVC.dot_acc_dis[Y_AXIS];

    // BVC.dot_acc_dis[Z_AXIS] = (BVC.acc_dis[Z_AXIS] - BVC.acc_dis_lpf[Z_AXIS]) * BVC.omega_wob;
    // BVC.acc_dis_lpf[Z_AXIS] += 0.5f * 1.0f / MOTION_CONTROL_FREQ * (BVC.dot_acc_dis[Z_AXIS] + BVC.dot_acc_dis_z1[Z_AXIS]);
    // BVC.dot_acc_dis_z1[Z_AXIS] = BVC.dot_acc_dis[Z_AXIS];

    //制御計算
    BVC.acc_ref[X_AXIS] = BVC.kp[X_AXIS] * (BVC.vel_cmd[X_AXIS] - BVC.vel_res[X_AXIS]);// + BVC.acc_dis_lpf[X_AXIS];
    BVC.acc_ref[Y_AXIS] = 0.0f;// + BVC.acc_dis_lpf[Y_AXIS];
    BVC.acc_ref[Z_AXIS] = BVC.kp[Z_AXIS] * (BVC.vel_cmd[Z_AXIS] - BVC.vel_res[Z_AXIS]);// + BVC.acc_dis_lpf[Z_AXIS];//zだけ補償


    //分解加速度制御 ヤコビが定数なのでヤコビ時間微分が0
    BVC.ddq_ref[SV1_FR] = BVC.invJaco[SV1_FR][X_AXIS] * BVC.acc_ref[X_AXIS] + BVC.invJaco[SV1_FR][Y_AXIS] * BVC.acc_ref[Y_AXIS] + BVC.invJaco[SV1_FR][Z_AXIS] * BVC.acc_ref[Z_AXIS];
    BVC.ddq_ref[SV2_FL] = BVC.invJaco[SV2_FL][X_AXIS] * BVC.acc_ref[X_AXIS] + BVC.invJaco[SV2_FL][Y_AXIS] * BVC.acc_ref[Y_AXIS] + BVC.invJaco[SV2_FL][Z_AXIS] * BVC.acc_ref[Z_AXIS];


    //指示値
    BVC.tau_ref[SV1_FR] = BVC.ddq_ref[SV1_FR] * MOTOR_INERTIA;
    BVC.tau_ref[SV2_FL] = BVC.ddq_ref[SV2_FL] * MOTOR_INERTIA;


    BVC.i_ref[SV1_FR] = BVC.tau_ref[SV1_FR] / MOTOR_TORQUE_CONSTANT * SV1_DIRECTION;
    BVC.i_ref[SV2_FL] = BVC.tau_ref[SV2_FL] / MOTOR_TORQUE_CONSTANT * SV2_DIRECTION;
    BVC.i_ref[SV3_HR] = 0.0f;
    BVC.i_ref[SV4_HL] = 0.0f;

    for(int i = 0; i < 4; i++){
        if(BVC.i_ref[i] > MOTOR_CURRENT_LIMIT){
            BVC.i_ref[i] = MOTOR_CURRENT_LIMIT;
        }else if(BVC.i_ref[i] < - MOTOR_CURRENT_LIMIT){
            BVC.i_ref[i] = - MOTOR_CURRENT_LIMIT;
        }
    }
#endif


}
